package First;

public class Database_Basics
{
    /*
    데이터베이스의 정의와 특징

    실시간 접근
    - 사용자의 데이터 요구에 실시간으로 응답
    - 계속 변화
    - 데이터의 계속적인 삽입, 삭제, 수정을 통해 현재의 정확한 데이터를 유지

    데이터베이스의 기본 개념

    데이터(Data)
    - 현실 세계에서 단순히 관찰하거나 측정하여 수집한 사실이나 값

    정보 (information)
    - 의사 결정에 유용하게 활용할 수 있도록 데이터를 처리한 결과물

    정보 처리(information processing)
    - 데이터에서 정보를 추출하는 과정 또는 방법

    정보 시스템(information system)
    - 조직 운영에 필요한 데이터를 수집하여 저장해두었다가 필요할 때 유용한 정보를 만들어 주는 수단

    데이터베이스
    - 정보 시스템 안에서 데이터를 저장하고 있다가 필요할 때 제공하는 역할.
    - 특정 조직의 여러 사용자가 공유하여 사용할 수 있도록 통합해서 저장한 운영 데이터의 집합

    공유 데이터
    - 특정 조직의 여러 사용자가 함께 소유하고 이용할 수 있는 공용 데이터

    통합 데이터
    - 최소의 중복과 통제 가능한 중복만 허용하는 데이터

    저장 데이터
    - 컴퓨터가 접근할 수 있는 매체에 저장된 데이터

    운영 데이터
    - 조직의 주요 기능을 수행하기 위해 지속적으로 꼭 필요한 데이터

    형태에 따른 데이터 분류
    정형 데이터
    - 구조화된 데이터, 즉 미리 정해진 구조에 따라 저장된 데이터

    반정형 데이터
    - 구조에 따라 저장된 데이터이지만 데이터 내용 안에 구조에 대한 설명이 함께 존재
    - 구조를 파악하는 파싱(Parsing) 과정이 필요, 보통 파일 형태로 저장

    비정형 데이터
    - 정해진 구조가 없이 저장된 데이터

    특성에 따른 데이터 분류
    - 범주형 데이터
    - 수치형 데이터

    정성적 데이터(qualitative data)

    - 좁은 의미로는 범주형 데이터
    - 사람의 주관적인 생각과 평가를 기술한 비정형 데이터

    데이터베이스(DataBase)
    - 개발의 전체적인 것을 할 수 있는 사람이 DB일을 할 수 있음
    - 현대 사회에서 DataBase 가 필요하지 않은 일은 없다.

    뷰 = 눈으로 보이는 것

    * 자격증 시험에서 정규화에 관련된 것이 나올 수 있음.

    - 팀과제 2인 1조(영화 예매 관리에 대한 데이터 베이스 or 주차장, 편의점 등)
    - 툴 활용 실습은 2주 수업듣는것으로 가능할 정도임.
    - 데이터 베이스는 이론 과목으로 진행.
     */
}
